// 正则解释映射表
export const SCHEMA = [
  { re: /\\d/, desc: '匹配一个数字字符 (0-9)' },
  { re: /\\w/, desc: '匹配字母、数字或下划线' },
  { re: /\\s/, desc: '匹配任意空白符 (空格、制表符)' },
  { re: /\^/, desc: '匹配字符串的开始位置' },
  { re: /\$/, desc: '匹配字符串的结束位置' },
  { re: /\.\*/, desc: '匹配任意字符 (零个或多个)' },
  { re: /\+/, desc: '匹配前面的子表达式一次或多次' },
  { re: /\*/, desc: '匹配前面的子表达式零次或多次' },
  { re: /\?/, desc: '匹配前面的子表达式零次或一次 (或开启非贪婪模式)' },
  { re: /\[.*\]/, desc: '字符集合，匹配方括号内的任意字符' },
  { re: /\(.*\)/, desc: '捕获分组，记忆匹配到的内容' },
  { re: /\{(\d+),?(\d+)?\}/, desc: '限定符，匹配前面的元素指定次数' },
  { re: /\\b/, desc: '匹配一个单词边界' },
  { re: /\|/, desc: '指明两项之间的一个选择 (或)' },
]

// 常用正则库
export const regexLib = [
  { name: '手机号', pattern: '^1[3-9]\\d{9}$', flags: ['g'], test: '13800138000' },
  {
    name: '邮箱',
    pattern: '^[\\w-\\.]+@([\\w-]+\\.)+[\\w-]{2,4}$',
    flags: ['g'],
    test: 'admin@vue.js',
  },
]
